Public Attributes | List of all members
API_AnalyticalLoadFactor Struct Reference
Analytical Model
Describes how a Load Case belongs to a Load Combination. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_Guid  | loadCaseGuid
Guid of Load Case.
 GS::Optional< double >  | factor
Load factor of the load case.
 double  | multiplier
A multiplier for e.g. increase the selfweight of the structure.
Detailed Description
Describes how a Load Case belongs to a Load Combination.
Since
Archicad 25